posts/2020-07-13-org-agenda-icons/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pretty Org-Agenda</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Pretty Org-Agenda</h1>
</header><p>
A few days ago <a href="https://www.reddit.com/r/emacs/comments/hnf3cw/my_orgmode_agenda_much_better_now_with_category/">this Reddit post</a> about icons in the org-agenda view took me by
surprise. In the past I have tried to find ways to use different colors
depending on the context of a TODO item (without any success), but I never
thought about using icons (or that org-mode even supports category based icons).
I was even more impressed when a user called "asiledeneg" posted some elisp code
to use the all-the-icons Emacs package. Thank you kind internet strangers for
your code samples. You made my org-agenda glorious:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun fw/agenda-icon-material (name)
  "Returns an all-the-icons-material icon"
  (list (all-the-icons-material name)))

;; https://old.reddit.com/r/emacs/comments/hnf3cw/my_orgmode_agenda_much_better_now_with_category/
(setq org-agenda-category-icon-alist
      `(("Birthday" ,(fw/agenda-icon-material "cake") nil nil :ascent center)
        ("Anniversary" ,(fw/agenda-icon-material "favorite") nil nil :ascent center)))
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2020-07-13</p>
<footer>
<p>Copyright 2024, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
